ZetaWeb.Exchange/src/InformationRegisters/зс_веб_ЗапросыОбъектовОбмена/зс_веб_ЗапросыОбъектовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зс_веб_ЗапросыОбъектовОбмена</name>
  <resources>
    <name>ИмяМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасширенныйИмпорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРазделителиОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапросПолный</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗапросИзменения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗапросРазделителиПолный</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗапросРазделителиИзменения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>УсловиеРазделителяВПолномОбмене</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УсловиеРазделителяВОбменеИзменениями</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаПоддержке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидКонфигурации</name>
    <type>
      <types>CatalogRef.ЗетаWEBВидыКонфигураций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектОбмена</name>
    <type>
      <types>CatalogRef.зс_веб_ОбъектыОбмена</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ZetaWeb.Exchange/src/InformationRegisters/зс_веб_ЗапросыОбъектовОбмена/RecordSetModule.bsl
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		ПроверитьПравильностьЗаполненияЗаписи(Запись);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПравильностьЗаполненияЗаписи(Запись)
	
	// в запросе изменений должен быть параметр "&ПО1C2WEB"
	Если СтрНайти(ВРег(Запись.ЗапросИзменения), "&ПО1C2WEB") = 0 Тогда
		
		ВызватьИсключение "В запросе изменений должен быть параметр ""&ПО1C2WEB""";
		
	КонецЕсли;
	
	// если используются разделители обмена, то
	Если Запись.ИспользоватьРазделителиОбмена Тогда
	
		//	в запросе разделители изменений должен быть параметр "&ПО1C2WEB"
		Если СтрНайти(ВРег(Запись.ЗапросРазделителиИзменения), "&ПО1C2WEB") = 0 Тогда
			
			ВызватьИсключение "В запросе разделители изменений должен быть параметр ""&ПО1C2WEB""";
			
		КонецЕсли;
		
		//	в запросах разделителей должно быть поле "КАК РазделительОбмена"
		Если СтрНайти(ВРег(Запись.ЗапросРазделителиПолный), "КАК РАЗДЕЛИТЕЛЬОБМЕНА") = 0 Тогда
			
			ВызватьИсключение "В запросе разделители полный должно быть поле ""КАК РазделительОбмена""";
			
		КонецЕсли;
		
		Если СтрНайти(ВРег(Запись.ЗапросРазделителиИзменения), "КАК РАЗДЕЛИТЕЛЬОБМЕНА") = 0 Тогда
			
			ВызватьИсключение "В запросе разделители изменения должно быть поле ""КАК РазделительОбмена""";
			
		КонецЕсли;
		
		//	в условиях разделителей должен быть параметр &РазделительОбмена
		Если СтрНайти(ВРег(Запись.УсловиеРазделителяВПолномОбмене), "&РАЗДЕЛИТЕЛЬОБМЕНА") = 0 Тогда
			
			ВызватьИсключение "В условии разделителя для полного обмена должно быть поле ""КАК РазделительОбмена""";
			
		КонецЕсли;
		
		Если СтрНайти(ВРег(Запись.УсловиеРазделителяВОбменеИзменениями), "&РАЗДЕЛИТЕЛЬОБМЕНА") = 0 Тогда
			
			ВызватьИсключение "В условии разделителя для обмена изменениями должно быть поле ""КАК РазделительОбмена""";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
